---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult.Success
enum: Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult
source: html/def069dd-2e03-7b93-6482-9bf28c70e7ed.htm
---
# Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult.Success

Operation was done with success.